package src.com.company;

public class HW41 {

    public static void main(String[] args) {


    /*
1.
В psvm класса HW1 создать объект класса PhoneNumber без аргументов с именем number
Задать значения полям number
Вывести поля в консоль


        PhoneNumber number = new PhoneNumber();
        number .num = 8411;
        number .numType = " Личный";
        System.out.printf(number.num + number.numType);
*/
    }
}
