package src.com.company;

import static java.lang.System.out;
/*
public class HW42 {
    public static void main(String[] args) {
/*
        В psvm класса HW2 создать два объекта класса PhoneNumber
        первый - с помощью конструктора без параметров и потом задать значения его полей
        второй - с помощью конструктора с двумя параметрами
        Вывести поля первого и второго объектов в консоль

        PhoneNumber q = new PhoneNumber();
        q .num = 8421;
        q .numType = " Личный hw42";
        PhoneNumber w = new PhoneNumber(" Личный hw42", 8422);
        System.out.println(q.num + q.numType);
        System.out.println(w.num + w.numType);
    }
}
*/