package src.Lesson5;//package Lesson5;
//
//private CircleMath () {}
//
//public class CircleMath<radius> {
//
//    private static String radiusaarea;
//    private double radius;
//
//this.radius =radius;
//
//    static double =Math.PI;
//    double lengthCircle = Math.PI * 2 * radius;
//    double areaCircle = Math.PI * (radius * radius);
//
//    double radiusalength = lengthCircle / (2 * Math.PI);
//    double radiusaarea = Math.sqrt(areaCircle / Math.PI);
//
//    static void draw() {
//        System.out.println("Радиусом окружности от площади круга равен " + radiusaarea);
//        System.out.println("Радиусом окружности от длины окружности равен " + radiusalength);
//        System.out.println("Площадь круга равна " + areaCircle);
//        System.out.println("Длина окружности равна " + lengthCircle);
//    }
//
//    public static void main(String[] args) {
//        private static void printCount () {
//        }
//    }
//}
///*/
//    Создать класс CircleMath
//    Добавить единственный пустой конструктор с модификатором доступа private (писать модификатор перед CircleMath)
//    Добавить static поле со значением PI
//    Добавить static методы для вычисления длины окружности и площади окружности
//    У обоих методов входные данные - дробное число с радиусом окружности;
//    выходные данные - дробное число с результатом операции
//    В psvm проверить работу этого класса: использовать оба метода класса без создания объекта
//    /*/


