package src.Lesson5;//package Lesson5;
//
//public class HW52 {
//
//
//    public static void main(String[] args) {
//
//
//        Plant x = new Plant();
//        x height = 10;
//        x width = 15;
//        System.out.printf(height + width);
//
//    }
//void draw(){
//    System.out.println("Plant");
//}
//}
///*
//Создать класс Plant
//Поля Plant:
//    Дробное число height для высоты растения
//    Дробное число width для ширины растения
//Конструкторы:
//    один с двумя аргументами с типами как у полей, другой - пустой
//Метод grow:
//    Нет входных, выходных данных
//    Выводит в консоль строку "Я расту"
//В psvm создать объект класса Plant, вывести поля объекта, вызвать метод grow
// */