package src.Lesson5;//package Lesson5;
//
//public class Plant {
//
//    int height;
//    int width;
//
//    public Plant(){}
//
//    public Plant(){
//        this.height= height;
//        this.width= width;
//    }
//
//    void draw() {
//        System.out.println("Я расту");
//    }
//}
//
//
///*
//Создать класс Plant
//Поля Plant:
//    Дробное число height для высоты растения
//    Дробное число width для ширины растения
//Конструкторы:
//    один с двумя аргументами с типами как у полей, другой - пустой
//Метод grow:
//    Нет входных, выходных данных
//    Выводит в консоль строку "Я расту"
//В psvm создать объект класса Plant, вывести поля объекта, вызвать метод grow
// */